{
    "primaryMissions": [
      {
        "name": "Strategic Hold",
        "rule": "From the second battle round onward, during the players command phase (or end of game if 5th round and going second), gain 2VP for controlling an objective in your deployment zone, 4vp for controlling an objective in No mans Land and 6vp for controlling an objective in the opponents deployment zone.",
        "image": ""
      },
      {
        "name": "Ancient Relic",
        "rule": "At the start of the game, randomly select one objective marker to be the Ancient Relic. <br/><b>Ancient Relic (Action)</b><br/>Starts: Your movement phase <br/>Units: One unit from your army <br/>Completes: End of your turn.<br/> If completed: The player whose turn it is places a marker on the Ancient Relic. They score 5VP for each turn they control the Ancient Relic until it is removed or the end of the game.",
        "image": ""
      },
      {
        "name": "Severed Supply Lines",
        "rule": "From the second battle round onward during the command phase, score 4VP for each objective marker you control, only if you control an objective in your deployment zone.",
        "image": ""
      }
    ],
    "missionRules": [
      {
        "name": "Fortified Positions",
        "rule": "Players can use their command points to give battleline units a +1 to their cover save, but not more than once per turn per unit.",
        "image": ""
      },
      {
        "name": "Shadow Operations",
        "rule": "After deployment, both players roll a d6. The highest roll gets to redeploy d6 units",
        "image": ""
      },
      {
        "name": "Tactical Superiority",
        "rule": "While a player's Warlord is within their deployment zone, units from that players army gain +1 OC",
        "image": ""
      }
    ],
    "deployments": [
      {
        "name": "Encircled Assault",
        "rule": "foobar",
        "image": "./static/images/encircledassault.png"
      },
      {
        "name": "Fortress Defense",
        "rule": "foobar",
        "image": "./static/images/fortressdefense.png"
      },
      {
        "name": "Recon and Secure",
        "rule": "foobar",
        "image": "./static/images/reconandsecure.png"
      }
    ]
  }